app/Controllers/EmployeeController.php

SELECT *
FROM `users`
WHERE `User_ID` = '4'
 LIMIT 1
---
  public function dashboard()
  {
    $session = session();
    $ses_userid = $session->get('ses_id');
    $ses_posid = $session->get('ses_pos_id');
    $data_sending = [];
    if (isset($ses_userid)) {
      if ($ses_posid >= 2) {
        $model = new UsersModel();
        $data = $model->where('User_ID', $ses_userid)->first();