app/Controllers/Home.php

    public function index()
    {
        $session = session();
        $ses_userid = $session->get('ses_id');
        $ses_posid = $session->get('ses_pos_id');
        $data_sending = [];
        $movetohomepage_msg = $session->get('C00002');
        if (isset($movetohomepage_msg)) {
        print "<script type=\"text/javascript\">alert('ข้อผิดพลาด: คุณได้เข้าสุ่ระบบอยู่แล้ว!\\nErrorCode: C00002');</script>";
        unset($_SESSION['C00002']);
        }
        if (isset($ses_userid)) {
          if (isset($ses_userid) && !isset($ses_posid)) {
            $model = new Customer();
            $data = $model->where('Cus_ID', $ses_userid)->first();
---
SELECT *
FROM `customer`
WHERE `Cus_ID` = '1'
 LIMIT 1