app/Controllers/Reservation.php

  public function index()
  {
    $session = session();
    $ses_userid = $session->get('ses_id');
    $ses_posid = $session->get('ses_pos_id');
    $data_sending = [];
    if (isset($ses_userid)) {
      if (isset($ses_userid) && !isset($ses_posid)) {
        $model = new Customer();
        $data = $model->where('Cus_ID', $ses_userid)->first();
---
SELECT *
FROM `customer`
WHERE `Cus_ID` = '1'
 LIMIT 1