app/Controllers/ReservationController.php

  public function reservation()
  {
    $session = session();
    $ses_userid = $session->get('ses_id');
    $first_station = $this->request->getvar('first_station');
    $end_station = $this->request->getvar('end_station');
    $time = $this->request->getvar('time');
    $date = $this->request->getvar('date');
    $data_sending = [];
    if (isset($ses_userid)) {
      $model = new UsersModel();
      $data = $model->where('User_ID', $ses_userid)->first();
---
SELECT *
FROM `users`
WHERE `User_ID` = '4'
 LIMIT 1

        'Total_Price' => $total_price,
        'Status' => "waiting",
      ];
      $model_reservation->save($data);
---
INSERT INTO `reservation` (`Reserve_Code`, `User_ID`, `Re_Seate`, `Re_DateTime`, `Go_Date`, `GoBack`, `Dock_car_id`, `Tic_Price_ID`, `Station_Start`, `Station_End`, `Total_Price`, `Status`) VALUES ('V109180322', '4', '6', '2022-03-18 14:03:24', '2022-03-18', 'GO', '109', '4', '1', '5', 330, 'waiting')

  public function check_reservation()
  {
    $session = session();
    $ses_userid = $session->get('ses_id');
    $data_sending = [];
    if (isset($ses_userid)) {
      $model = new UsersModel();
      $data = $model->where('User_ID', $ses_userid)->first();
---
SELECT *
FROM `users`
WHERE `User_ID` = '4'
 LIMIT 1