app/Controllers/TicketController.php

SELECT *
FROM `users`
WHERE `User_ID` = '4'
 LIMIT 1
---
  public function his_reservation()
  {
    $session = session();
    $ses_userid = $session->get('ses_id');
    $data_sending = [];
    if (isset($ses_userid)) {
      $model = new UsersModel();
      $data = $model->where('User_ID', $ses_userid)->first();