app/Controllers/UserController.php

  public function index()
  {
    $session = session();
    $ses_userid = $session->get('ses_id');
    $data_sending = [];
    $model_station = new StationModel();
    $data_sending['station_getStations'] = $model_station->getStation();
    $data_sending['station_getStation_NK'] = $model_station->getStationNK();
    if (isset($ses_userid)) {
      $model = new UsersModel();
      $data = $model->where('User_ID', $ses_userid)->first();
---
SELECT *
FROM `users`
WHERE `User_ID` = '4'
 LIMIT 1

  public function profile()
  {
    $session = session();
    $ses_userid = $session->get('ses_id');
    $data_sending = [];
    if (isset($ses_userid)) {
      $model = new UsersModel();
      $data = $model->where('User_ID', $ses_userid)->first();
---
SELECT *
FROM `users`
WHERE `User_ID` = '4'
 LIMIT 1

  public function table_reservation()
  {
    $session = session();
    $ses_userid = $session->get('ses_id');
    $data_sending = [];
    if (isset($ses_userid)) {
      $model = new UsersModel();
      $data = $model->where('User_ID', $ses_userid)->first();
---
SELECT *
FROM `users`
WHERE `User_ID` = '4'
 LIMIT 1