app/Models/DockCarModel.php

SELECT *
FROM `dock_car`
JOIN `van` ON `dock_car`.`Van_ID` = `van`.`Van_ID`
WHERE `Station_ID` = 7
ORDER BY `Van_Out`
---
  public function viewDockCar_kanjanaburi()
  {
    return $this->db
      ->table('dock_car')
      ->join('van', 'dock_car.Van_ID = van.Van_ID')
      ->where('Station_ID', 7)
      ->orderBy('Van_Out', 'ASD')
      ->get()->getResultArray();

SELECT *
FROM `dock_car`
JOIN `van` ON `dock_car`.`Van_ID` = `van`.`Van_ID`
WHERE `Station_ID` = 1
ORDER BY `Van_Out`
---
  public function viewDockCar_nakhonpathom()
  {
    return $this->db
      ->table('dock_car')
      ->join('van', 'dock_car.Van_ID = van.Van_ID')
      ->where('Station_ID', 1)
      ->orderBy('Van_Out', 'ASD')
      ->get()->getResultArray();