app/Models/PaymentModel.php

  public function getStatus($userId, $Reserve_ID)
  {
    $where_sql = "User_ID = {$userId} AND Reserve_ID = {$Reserve_ID}";
    return $this->db
      ->table('payment')
      ->where($where_sql)
      ->orderBy('Pay_ID', 'DESC')
      ->limit(1)
      ->get()
      ->getResultArray();
---
SELECT *
FROM `payment`
WHERE `User_ID` = 4 AND `Reserve_ID` = 7
ORDER BY `Pay_ID` DESC
 LIMIT 1

  public function getReservationAfterConfirm($userId)
  {
    $where_sql = "payment.User_ID = {$userId}";
    $data = $this->db
      ->table('payment')
      ->join('reservation', 'reservation.Reserve_ID = payment.Reserve_ID')
      ->join('dock_car', 'reservation.Dock_car_id = dock_car.Dock_car_id')
      ->join('ticket_price', 'reservation.Tic_Price_ID = ticket_price.Tic_Price_ID')
      ->where($where_sql)
      ->orderBy('Reservation.Reserve_ID', 'DESC')
      ->limit(1)
      ->get()
      ->getResultArray();
---
SELECT *
FROM `payment`
JOIN `reservation` ON `reservation`.`Reserve_ID` = `payment`.`Reserve_ID`
JOIN `dock_car` ON `reservation`.`Dock_car_id` = `dock_car`.`Dock_car_id`
JOIN `ticket_price` ON `reservation`.`Tic_Price_ID` = `ticket_price`.`Tic_Price_ID`
WHERE `payment`.`User_ID` = 4
ORDER BY `Reservation`.`Reserve_ID` DESC
 LIMIT 1