app/Models/StationModel.php

SELECT *
FROM `station`
ORDER BY `Station_ID` ASC
---
  public function getStation()
  {
    return $this->db
    ->table('station')
    ->orderBy('Station_ID', 'ASC')
    ->get()->getResultArray();

SELECT *
FROM `station`
WHERE `Station_ID` = 1 OR `Station_ID` = 7
ORDER BY `Station_ID` ASC
---
  public function getStationNK()
  {
    $where_sql = "Station_ID=1 OR Station_ID=7";
    return $this->db
    ->table('station')
    ->where($where_sql)
    ->orderBy('Station_ID', 'ASC')
    ->get()->getResultArray();

SELECT *
FROM `station`
WHERE `Station_ID` = '7'
 LIMIT 1
---
  public function getStationById_S($first_station)
  {
    $data = $this->where('Station_ID', $first_station)->first();

SELECT *
FROM `station`
WHERE `Station_ID` = '4'
 LIMIT 1
---
  public function getStationById_E($end_station)
  {
    $data = $this->where('Station_ID', $end_station)->first();