app/Models/TicketModel.php

SELECT *
FROM `ticket`
JOIN `payment` ON `ticket`.`Pay_ID` = `payment`.`Pay_ID`
JOIN `reservation` ON `payment`.`Reserve_ID` = `reservation`.`Reserve_ID`
WHERE `reservation`.`User_ID` = 4 and `payment`.`Confirm` = 'success'
ORDER BY `Tick_ID` DESC
---
  public function get_history($user_ID)
  {
    $where_sql = "reservation.User_ID = {$user_ID} and payment.Confirm = 'success'";
    return $this->db
      ->table('ticket')
      ->join('payment', 'ticket.Pay_ID = payment.Pay_ID')
      ->join('reservation', 'payment.Reserve_ID = reservation.Reserve_ID ')
      ->where($where_sql)
      ->orderby('Tick_ID', 'Desc')
      ->get()->getResultArray();