app/Models/TicketPriceModel.php

    public function getTicketPriceById($first_station, $end_station)
    {
      $where_sql = "Station_Start={$first_station} AND Station_End={$end_station}";
      $data = $this->where($where_sql)->first();
---
SELECT *
FROM `ticket_price`
WHERE `Station_Start` = 1 AND `Station_End` = 5
 LIMIT 1

    public function CountTicketNtoK()
    {
      return $this->db
      ->table('ticket_price')
      ->join('station', 'ticket_price.Station_End = station.Station_ID')
      ->where('Station_Start', 1)
      ->orderBy('Tic_Price', 'ASC')
      ->get()->getResultArray();
---
SELECT *
FROM `ticket_price`
JOIN `station` ON `ticket_price`.`Station_End` = `station`.`Station_ID`
WHERE `Station_Start` = 1
ORDER BY `Tic_Price` ASC

    public function CountTicketKtoN()
    {
      return $this->db
      ->table('ticket_price')
      ->join('station', 'ticket_price.Station_End = station.Station_ID')
      ->where('Station_Start', 7)
      ->orderBy('Tic_Price', 'ASC')
      ->get()->getResultArray();
---
SELECT *
FROM `ticket_price`
JOIN `station` ON `ticket_price`.`Station_End` = `station`.`Station_ID`
WHERE `Station_Start` = 7
ORDER BY `Tic_Price` ASC